/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_bzero.c                                         :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: mogawa <mogawa@student.42tokyo.jp>         +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/01/11 10:38:09 by mogawa            #+#    #+#             */
/*   Updated: 2023/06/20 15:05:04 by mogawa           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "libft.h"

/*
*引数1: 文字列
*引数２: バイト数
*戻り値： なし
*フリー 不要
*機能:
 文字列ｓにｎバイト分の０を書き込む
*/
void	ft_bzero(void *s, size_t n)
{
	ft_memset(s, 0, n);
}
